nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, TRC, [256]] #
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, TRC, [512]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, TRC, [512]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, TRC, [1024]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10


head:
  #
  - [1, 1, Conv, [512]]  # 11: P2/4 (512 ch)
  - [3, 1, Conv, [512]]  # 12: P3/8 (512 ch)
  - [5, 1, Conv, [512]]  # 13: P4/16 (512 ch)
  - [10, 1, Conv, [512]] # 14: P5/32 (512 ch)

  # 自顶向下路径 (Top-down)
  - [14, 1, nn.Upsample, [None, 2, 'nearest']]  # 15: P5->P4
  - [[15, 13], 1, MSPF, []]  # 16:
  - [-1, 3, C3k2, [512, False]]  # 17: 新P4 (512通道)

  - [17, 1, nn.Upsample, [None, 2, 'nearest']]  # 18: P4->P3
  - [[18, 12], 1, MSPF, []]  # 19:
  - [-1, 3, C3k2, [512, False]]  # 20:

  - [20, 1, nn.Upsample, [None, 2, 'nearest']]  # 21: P3->P2
  - [[21, 11], 1, MSPF, []]  # 22:
  - [-1, 3, C3k2, [512, False]]  # 23: 新P2

  # 自底向上路径 (Bottom-up)
  - [23, 1, Conv, [512, 3, 2]]  # 24: P2->P3 (下采样)
  - [[24, 20], 1, AMF, []]  # 25:
  - [-1, 3, C3k2, [512, True]]  # 26: 更新P3

  - [26, 1, Conv, [512, 3, 2]]  # 27: P3->P4 (下采样)
  - [[27, 17], 1, AMF, []]  # 28: 融合P3↓ + P4
  - [-1, 3, C3k2, [1024, True]]  # 29: 更新P4

  # 检测头 (P2, P3, P4)
  - [[23, 26, 29], 1, Detect, [nc]]  # Detect(P2 P3 P4)